# SpecificHeat Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..SpecificHeat Property
SpecTypeId Class See Also
---
Specific Heat, in discipline Energy.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SpecificHeat { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpecificHeat As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpecificHeat {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace